# GridlinesWerePushed Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..CurtainWallFailures..::..GridlinesWerePushed Property
BuiltInFailures..::..CurtainWallFailures Class See Also
---
Panels and mullions created by a curtain grid were created with slight inaccuracies.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId GridlinesWerePushed { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property GridlinesWerePushed As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ GridlinesWerePushed {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..CurtainWallFailures Class
Autodesk.Revit.DB Namespace